
#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ОборудованиеСумма.ТекстПодвала = Объект.Оборудование.Итог("Сумма");
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОборудование
&НаКлиенте
Процедура ОборудованиеЦенаПриИзменении(Элемент)
	ПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура ОборудованиеКоличествоПриИзменении(Элемент)
	ПриИзменении();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ПриИзменении()
	СтрокаТабличнойЧасти = Элементы.Оборудование.ТекущиеДанные;
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество;
	Элементы.ОборудованиеСумма.ТекстПодвала = Объект.Оборудование.Итог("Сумма");
КонецПроцедуры
#КонецОбласти


