
//&НаСервереБезКонтекста
//Процедура ПередЗаписьюНаСервере(НаименованиеПродукта, ЦенаПродукта)
//	
//	Выборка = Справочники.Товары.Выбрать();
//	Пока Выборка.Следующий() Цикл
//		Объект = Выборка.ПолучитьОбъект();
//		Для Каждого СтрокаТабличнойЧасти из Объект.Продукты Цикл
//			Если СтрокаТабличнойЧасти.Продукт.Наименование = НаименованиеПродукта Тогда
//				СтрокаТабличнойЧасти.Цена = ЦенаПродукта;
//				СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Норма;
//			КонецЕсли;
//			Объект.ЦенаБлюда = Объект.Продукты.Итог("Сумма")/100;
//		КонецЦикла;
//	Попытка
//		Объект.Записать();
//	Исключение	
//	Сообщить("Ошибка записи!");
//	КонецПопытки;

//	КонецЦикла;

//КонецПроцедуры


//&НаКлиенте
//Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
//	ПередЗаписьюНаСервере(Объект.Наименование, Объект.Цена);
//КонецПроцедуры

