#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары
&НаКлиенте
Процедура ТоварыТоварПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти.Цена = ОбщиеПроцедурыВызовСервера.ПолучитьЗначениеРеквизитаНаСервере(СтрокаТабличнойЧасти.Товар, "ЦенаБлюда");
	СтрокаТабличнойЧастиВыход = Строка(ОбщиеПроцедурыВызовСервера.ПолучитьЗначениеРеквизитаНаСервере(СтрокаТабличнойЧасти.Товар, "ЗначениеВеса"));
	СтрокаТабличнойЧастиВыходЕдиницаИзмерения = Строка(ОбщиеПроцедурыВызовСервера.ПолучитьЗначениеРеквизитаНаСервере(СтрокаТабличнойЧасти.Товар, "ЕдиницаИзмерения"));
	СтрокаТабличнойЧасти.Выход = СтрокаТабличнойЧастиВыход + СтрокаТабличнойЧастиВыходЕдиницаИзмерения;
КонецПроцедуры
#КонецОбласти
