
#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПересчетСуммы();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПереченьРемонта
&НаКлиенте
Процедура ПереченьРемонтаЦенаПриИзменении(Элемент)
	ПересчетСуммы();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ПересчетСуммы()
	Элементы.ПереченьРемонтаЦена.ТекстПодвала = Объект.ПереченьРемонта.Итог("Цена");
КонецПроцедуры
#КонецОбласти


