#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = ПолучитьМакет("НарядЗаказ");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ФормированиеНарядЗаказа.Дата,
	|	ФормированиеНарядЗаказа.Номер,
	|	ФормированиеНарядЗаказа.Товары.(
	//|		НомерСтроки,
	|		Товар,
	//|		Цена,
	//|		Выход,
	//|		Количество
	|	)
	|ИЗ
	|	Документ.ФормированиеНарядЗаказа КАК ФормированиеНарядЗаказа
	|ГДЕ
	|	ФормированиеНарядЗаказа.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	//ОбластьВертикальнаяШапка = Макет.ПолучитьОбласть("ВертикальнаяШапка");
		//ОбластьТоварыШапка = Макет.ПолучитьОбласть("ТоварыШапка");
	//ОбластьТовары = Макет.ПолучитьОбласть("Товары");
	ТабДок.Очистить();
	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ОбластьЗаголовок.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(ОбластьЗаголовок);

		//Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка);

		//ТабДок.Вывести(ОбластьТоварыШапка);
		ВыборкаТовары = Выборка.Товары.Выбрать();
		Пока ВыборкаТовары.Следующий() Цикл
			Для Каждого Продукт Из ВыборкаТовары.Товар.Продукты Цикл
				//ОбластьВертикальнаяШапка.Параметры.Заполнить(Продукт.Продукт);
				//ТабДок.Вывести(ОбластьВертикальнаяШапка);
				//ОбластьЗаголовок.Параметры.Заполнить(Продукт.Продукт);
				//ТабДок.Вывести(ОбластьЗаголовок);
				//Сообщить(Продукт.Продукт.Наименование);
				//ОбластьТовары.Параметры.Заполнить(Продукт.Продукт);
				//ТабДок.Вывести(ОбластьТовары, ВыборкаТовары.Уровень());
			КонецЦикла;
			//ОбластьТовары.Параметры.Заполнить(ВыборкаТовары);
			//ТабДок.Вывести(ОбластьТовары, ВыборкаТовары.Уровень());
		КонецЦикла;
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
#КонецОбласти
#КонецЕсли